import React from 'react'
import { WeixinTitle } from 'react-weixin-title'
import { Button } from 'antd-mobile'

import '../../common/stylus/textAndApplication.styl'

class Protocol extends React.Component {

  render() {

    return (
      <WeixinTitle title='马德里商标申请支援' src=''>
        <div style={{ height: '100vh', overflow: 'auto', background: '#fff', position: 'fixed', left: '0', right: '0', top: '0', bottom: '0' }}>
          <main className='text-app'>
            <h1>
              平台服务协议
            </h1>
            <p>

            本服务协议适用于寰球智金·知识产权海外维权及国际合作平台的注册客户，若您决定使用本平台所提供的服务，您必须同意下列条款（即本服务协议）。
            </p>
<p>

            当您使用本平台为您提供的服务时，即表示您已经阅读、了解并同意接受下列条款（即本服务协议）。此外，您在本平台的一切行为也将被认为您接受以下服务条款：
</p>
<h2>

            一、 关于本服务协议
</h2>
            <p>

            1.当您使用本平台所提供的服务时，您已经知晓并且同意本服务协议中的所有条款。
            </p>
<p>

            2.本平台有权于任何时间修改或变更本服务协议。每次内容的修改或变更都会在本网站上进行发布，并立即生效。
            您于本服务协议之修改或变更之后继续使用本平台所提供的服务时，即表示您已经阅读、了解并同意接受本服务协议之修改或变更内容。
</p>
<p>

            3.如果您不同意，不接受本服务提款及其修改、变更内容，请您立即停止对本平台所提供的相关服务的利用。
</p>
<h2>

            二、 使用者义务
</h2>
<p>

            1.作为系统使用客户，使用者同意并保证对本平台的使用符合有关国际公约，各国法律法规及相关规定，不会利用本平台或本服务从事任何违反有关国际公约、各国法律法规及相关规定或有损于本平台及本服务的任何行为。
</p>
            <p>

            2. 作为系统使用客户，使用者应保证自身符合可以使用本平台所提供的服务的所有条件，并使本平台得免于因使用者的缺失而导致的所有或任何债务，并赔偿本平台因受到处罚所导致的相应支出，损失或赔偿。
            </p>
<p>

            3. 作为系统使用客户，使用者承诺绝不会以任何不正当或非法的方式使用本服务，亦不会利用本平台及本服务从事任何非法行为。
</p>
<p>

            4. 作为系统使用客户，使用者同意并保证不会利用本网站刊登、传送或储存任何诽谤、诈欺、侮辱、恐吓、色情、不实或其他不法之文字、图片或任何形式的资料。
</p>
<p>

            5. 作为系统使用客户，使用者同意并保证不会利用本平台或本服务侵害他人专利、商标、著作权或其他知识产权相关的其他权利。
</p>
<p>

            6. 作为系统使用客户，使用者同意并保证不会利用本平台或本公司及本服务用以广告或发送垃圾邮件、连锁信，传输或散布电脑病毒，主动提供邮件、布告或通信，或任何其他形式的未经同意的大量信件或信息。使用者同意并保证不使用关于本平台或本服务或其他客户的任何资料，进行上述的传送用途。
</p>
<p>

            7. 作为系统使用客户，使用者同意并保证不会对本平台或本服务进行任何形式的干扰或破坏。
</p>
<p>

            8. 作为系统使用客户，使用者同意并保证不会窃取或盗用其他用户的任何信息。
</p>

<h2>

            三、 服务内容声明
</h2>
<p>

            1.为了能够安全，准确并快速地为您提供服务，我们将在您的同意及确认下，通过填写表格等形式要求您提供一些关于您的基本信息。
            请你务必提供真实、准确、即时并完整的信息。若您提供的信息不真实、不准确、不即时或（和）不完整，本网站有权暂停或终止对您的服务，并删除您在本平台的任何资料且拒绝向您提供本服务之部分或全部。
            由于您所提供的信息的不真实、不准确、不即时或（和）不完整，所造成的一切损失，本平台均不承担任何责任。
</p>
<p>

            2.您在利用本服务过程中，所提供的关于您的基本信息以及您的专利信息，本平台将为您保密。但依照政府司法机关按照法定程序要求的提供或为公共安全之目的需要的提供除外。
</p>
<p>
            3.您在使用本服务时，请务必依据本网站所提示的步骤，正确且完整地填写关键信息并进行委托。
            若您提供不真实、不正确、不即时或（和）不完整的专利信息，本平台有权不受理您的提交请求，并视您与本平台之间的委托关系为不存在。若因此而造成您的一切损失时，本平台均不承担任何责任。

</p>
<p>
            4.如果您提供错误、不实、不完整的信息，或是您书面要求本平台停止办理尚未缴费予各国政府的专利年费缴纳，或是因您违反本服务协议而使本平台无法受理承办您所委托的专利年费缴纳的，该专利年费委托的相关费用如已付款给本公司时，您同意本公司在先扣除已经发生的作业费用及退费所需邮资等费用后，再由本公司或指定付款人退还剩余费用给您。

</p>
            <p>

            5.本平台所提供的关于专利年费的相关服务中，所涉及的各国专利年费标准、其各国政府规定费用、汇款手续费或本公司的代理服务费，将会随各国政府规定费用的调整、各国货币的国际汇率浮动、物价变动、作业成本及专利范围项目之变化而发生变化，本平台有权在必要时对与专利年费服务相关的诸项费用标准随时进行调整。
            </p>

<p>
            6.当您已经委托本平台为您代缴专利年费时，在本平台或本平台所提供的服务尚处于作业期间，尚未将您的专利年费缴纳至指定国家的专利机关前，若发生该专利授权国的国家政府突然调涨专利年费或国际汇率大幅升值时，您同意无条件地在本公司指定的期限内补缴差额费用予本公司。

</p>

            <p>
            7.您以任何形式提供予本公司或本公司网站的一切资料，视为您同意本公司或本公司网站可以基于维护本平台的服务系统程序正确进行、信息正确提供、网页美观、网页内容正确、网站程序正确运行、数据库正确运行、资料管理正确及网站能够正常、快速运行等目的，无条件使用、修改、编辑、移动该等资料，您对此决无异议。

            </p>
<h2>

            四、 免责条款
</h2>
<p>

            1.当相关国家的政府司法机关按照法定程序，要求本公司或本公司网站披露客户相关资料时，本公司或本公司网站将根据执法单位之要求或为公共安全之目的提供客户相关资料。在此情况下之任何披露，本平台均得免责。
</p>
<p>

            2.您在使用本平台所提供的关于专利年费的一系列服务时，请务必在具备以下条件的使用环境中进行：
</p>
<p>
            a.该使用环境须能保证本平台的服务系统能够正常运行；

</p>
            <p>

            b.该使用环境须能保证使用者能够正常向本平台提供信息；
            </p>
            <p>

            c.该使用环境须能保证使用者能够正常接收来自本平台的信息；
            </p>
            <p>

            d.该使用环境须能保证本公司网站所有内容的正常显示及美观；
            </p>
            <p>

            e.该使用环境须能保证本平台的服务系统中的数据库能够正常运行。
            </p>
            <p>

            对于因您在不具备上述条件的使用环境中，对本平台所提供的服务进行使用而产生的一切损害及后果，本平台均不承担任何责任。
            </p>
<p>

            3.由于您的个人行为而导致的任何个人资料泄露，本平台均得免责。
</p>
<p>

            4.任何由于计算机问题、黑客攻击、计算机病毒侵入或发作，因政府管制而造成的暂时性关闭等影响网络正常运行之不可抗力而造成的客户相关资料泄露、丢失、被盗用或被篡改或其他一切损失，因不属于本平台之过失，因此本平台不承担任何责任。
            您在使用本平台所提供的服务时应自行采取防护措施。
            本平台对于您因上述原因而无法使用本服务所造成的一切损失，均不承担任何直接或间接的责任。
</p>
<p>

            5.本平台提供的服务，不保证服务器提供商及电子邮件提供商，将本公司或本公司网站的任何邮件或资料于传送过程中或传送结束时，均具有安全性，不会断线或出错，对于因上述本平台所无法控制的原因而给您造成的一切损失，本平台均得免责。
</p>
<p>

            6.您使用本公司网站或经由本公司网站连结至其他网站及下载、浏览及储存任何资料，若因而造成您的电脑系统受损、储存资料遗失、侵害他人权利或其他一切损害，本平台均得免责。
</p>
<p>

            7. 本平台所提供的服务，不保证不会遭受他人干扰、攻击、破坏和（或）植入电脑病毒，若因此而给您造成任何直接或间接的损害，本平台均得免责。
</p>
<p>

            8. 由于与本公司网站链接的其他网站所造成的客户相关资料泄露及由此而导致的任何法律争议和后果，本平台均得免责。
</p>
<p>
            9. 本公司网站或利用本公司服务之第三人可能与其他公司所经营的网站或电子资源相连结，这不表示本平台与该公司或该电子资源有任何关系。
            您透过本公司网站连结至其他网站或其他电子资源所造成的一切损害，本平台均不承担任何直接或间接责任。

</p>
<p>

            10. 您在本公司网站上所浏览的所有非本公司或非本公司网站的广告内容、图片、文字、产品、服务及其他资讯，均由各该广告商、供应商、服务商、代理商、产品所有者所提出及规划。
            您必须自行了解上述广告及资讯的真实性。本平台不对上述广告、产品及一切服务资讯承担任何责任。
</p>
<p>

            11. 您在本公司网站上所浏览的所有非本公司或非本公司网站或经由本公司网站连结至其他网站的广告内容、图片、文字、产品、服务及其他资讯，您若因此与该广告商、供应商、服务商、代理商及产品所有者进行交易，本平台对于您所交易之商品、服务或其他交易标的物不承担任何担保或损害赔偿责任。
</p>
<p>

            12.为了本网站的正常运行，需要定期或不定期地对网站进行升级或停机维护，因此类情况而造成的正常服务中断，请您予以理解。我们将尽力避免服务中断或将中断时间限制在最短时间内。
</p>
            <p>

            若因线路及非本平台控制范围外的硬件故障或其他不可抗力而导致暂停服务，于暂停服务其间造成的一切不便与损失，本平台不负任何责任。但是本平台会尽合理的可能协助处理善后事宜，并努力使由此而给您带来的损害降到最低。
            </p>
<p>

            13.本平台及本服务，如因遭受天灾、战争或其他不可抗力所致之服务停止或中断，对于因此而造成您的任何直接或间接的损害，本平台不承担任何责任。
</p>
<p>

            14.本平台对于所提供的所有信息皆尽最大努力达到正确提供，如出现错误，将只依照实际发生的错误金额进行等额赔偿，除此之外的其他损失，本平台一概不予以赔偿。
</p>

            <h2>

            五、 其他条款
            </h2>
<p>

            1.本平台基于中华人民共和国的法律法规而建立，原则上以中华人民共和国的法律法规为基准。
</p>
            <p>

            本服务协议中未涉及事宜，原则上以中华人民共和国的相关法律、法规为基准。
            </p>
            <p>

            当本服务协议与中华人民共和国的法律法规发生冲突时，以中华人民共和国的相关法律法规为准。
            </p>
            <p>

            仅限于专利年费的问题上，在必要的情况，适当参考并遵守该项专利授权国的相关专利制度及相关专利法规。
            </p>
            <p>

            关于其他的法律事项，原则上都以中华人民共和国的法律法规为基准。
            </p>
<p>

            2.使用者在使用本网站或本服务过程中如遇到问题，请立即通过电话、QQ、微信公众号或者电子邮箱等形式与我们取得联系。
</p>
            <p>

            3. 如您违反了本服务协议或侵害了本平台的权益，或因使用本服务而侵害第三人权益时，您同意本平台不需经由您的同意或事前通知，即可终止您对任何部分服务或全部服务之使用，并移除或删除您在本平台的一切资料。若因此而给您或第三人造成的任何一切损害，本平台均不承担任何责任。
            </p>
<p>

            4. 本平台有权根据实际情况，在未经通知或未经由您的同意下，在任何时间，自行终止、限制、中断、暂停或变更服务内容并（或）修改费用, 并（或）变更本服务协议之内容。
</p>
<p>
            当您在使用本平台所提供的服务过程中，涉及不正当或不合法内容时，您同意本平台有权取消您的不正当或不合法内容，并（或）有权终止向您提供部分或全部服务，并（或）有权视本平台与您之间的委托关系为不存在。

</p>
            <p>

            本平台有权根据实际情况，在未经通知或未经由您的同意下，随时中断或停止或修改一项服务或多项服务，由于本服务终止或修改而造成您或第三人的任何一切损害，本平台均不承担任何责任。
            </p>
<p>

            5.本平台的所有内容版权均属于本公司所有。
</p>
            <p>

            未经本公司许可，禁止任何人的对任何部分内容或全部内容的修改、拷贝、公开、模仿、篡改、解码等一切侵犯本公司所有的知识产权的行为，若有违反者，应对本平台及其他权利人负一切损害赔偿责任。
            </p>
            <p>
            6. 本服务协议以及其修改权、更新权及最终解释权均属于本平台所有。对于其他未尽事宜的解释权归本平台所有。

            此外，本平台保留对服务内容和相关服务的费用标准的修改权。
            </p>
            <p>

            江苏环球惠通知识产权服务有限公司
            </p>




          </main>
          <section className='application' style={{ display: 'flex', justifyContent: 'center', alignItems: 'center' }}>
            <Button onClick={() => this.props.history.goBack()} style={{ color: '#fff', backgroundColor: '#ffda79', width: '100%' }}>返回</Button>
          </section>
        </div>

      </WeixinTitle>
    )
  }
}

export default Protocol